"use client";
import React from "react";
import { Accordion, AccordionItem } from "@nextui-org/react";
import { text } from "stream/consumers";

function Content() {
  return (
    <div className=" container mx-auto">
      <Accordion variant="splitted" className="" selectionMode="multiple">
        <AccordionItem
          key="1"
          aria-label="ส่วนที่ 1 - เรื่องราวของเจิดกับเซียง"
          title={
            <div className="w-auto flex justify-between items-center px-2  rounded-md">
              <div>
                <p className="text-[10px] md:text-[18px]">
                  ส่วนที่ 1 - เรื่องราวของเจิดกับเซียง
                </p>
              </div>
              <div className="flex justify-end items-center gap-2 pl-2 pr-2">
                <p className="text-[10px] md:text-[18px]">2 Units</p>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.9909 0.335938C5.55094 0.335938 0.335938 5.5626 0.335938 12.0026C0.335938 18.4426 5.55094 23.6693 11.9909 23.6693C18.4426 23.6693 23.6693 18.4426 23.6693 12.0026C23.6693 5.5626 18.4426 0.335938 11.9909 0.335938ZM12.0026 21.3359C6.84594 21.3359 2.66927 17.1593 2.66927 12.0026C2.66927 6.84594 6.84594 2.66927 12.0026 2.66927C17.1593 2.66927 21.3359 6.84594 21.3359 12.0026C21.3359 17.1593 17.1593 21.3359 12.0026 21.3359Z"
                    fill="white"
                  />
                  <path
                    d="M12.5859 6.16406H10.8359V13.1641L16.9609 16.8391L17.8359 15.4041L12.5859 12.2891V6.16406Z"
                    fill="white"
                  />
                </svg>
                <p className="text-[10px] md:text-[18px]">00:30:00</p>
              </div>
            </div>
          }
          className="p-3 mb-4 shadow text-[#393939]"
        >
          {[1, 2].map((item: any, index: number) => (
            <>
              <div
                key={index}
                className="border rounded-lg mb-2 p-3 bg-[#FFFFFF] text-[#393939] "
              >
                <div className="flex justify-between">
                  <div className="flex justify-normal gap-2">
                    <svg
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M0.335938 12.0094C0.335938 5.5699 5.57242 0.335938 12.0026 0.335938C18.4328 0.335938 23.6693 5.5699 23.6693 12.0094C23.6693 18.4353 18.4328 23.6693 12.0026 23.6693C5.57242 23.6693 0.335938 18.4353 0.335938 12.0094ZM16.2819 13.1901C16.4058 13.0663 16.5634 12.8749 16.5972 12.8299C16.7774 12.5935 16.8675 12.3009 16.8675 12.0094C16.8675 11.6818 16.7661 11.3779 16.5747 11.1303C16.559 11.1146 16.5283 11.0812 16.4882 11.0376C16.4133 10.956 16.3058 10.839 16.2031 10.7363C15.2796 9.74581 12.8697 8.12497 11.6085 7.62971C11.417 7.55205 10.9328 7.38209 10.6738 7.37083C10.426 7.37083 10.1895 7.42711 9.96432 7.53967C9.68279 7.69725 9.45756 7.94488 9.33369 8.23753C9.25486 8.44013 9.13098 9.04795 9.13098 9.05921C9.00711 9.7233 8.93954 10.8039 8.93954 11.997C8.93954 13.1349 9.00711 14.1694 9.10846 14.8447C9.11125 14.8475 9.12094 14.8958 9.13599 14.9708C9.18174 15.199 9.27705 15.6742 9.37873 15.869C9.62648 16.3417 10.1107 16.6344 10.6287 16.6344H10.6738C11.0116 16.6231 11.7211 16.3305 11.7211 16.3192C12.9148 15.824 15.2684 14.2819 16.2143 13.2576L16.2819 13.1901Z"
                        fill="#B8B8B8"
                      />
                    </svg>

                    <p className="text-[10px] md:text-[18px]">
                      เล่าถึงชีวิต เจิด
                    </p>
                  </div>

                  <p className="text-[10px] md:text-[18px]">00:30</p>
                </div>
              </div>
            </>
          ))}
        </AccordionItem>

        <AccordionItem
          key="2"
          aria-label="ส่วนที่ 2 - การทำงานกับโลกภายในของตนเอง"
          title={
            <div className="w-auto flex justify-between items-center px-2 rounded-md">
              <div>
                <p className="text-[10px] md:text-[18px]">
                  ส่วนที่ 2 - การทำงานกับโลกภายในของตนเอง
                </p>
              </div>
              <div className="flex justify-end items-center gap-2 pl-2 pr-2">
                <p className="text-[10px] md:text-[18px]">2 Units</p>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.9909 0.335938C5.55094 0.335938 0.335938 5.5626 0.335938 12.0026C0.335938 18.4426 5.55094 23.6693 11.9909 23.6693C18.4426 23.6693 23.6693 18.4426 23.6693 12.0026C23.6693 5.5626 18.4426 0.335938 11.9909 0.335938ZM12.0026 21.3359C6.84594 21.3359 2.66927 17.1593 2.66927 12.0026C2.66927 6.84594 6.84594 2.66927 12.0026 2.66927C17.1593 2.66927 21.3359 6.84594 21.3359 12.0026C21.3359 17.1593 17.1593 21.3359 12.0026 21.3359Z"
                    fill="white"
                  />
                  <path
                    d="M12.5859 6.16406H10.8359V13.1641L16.9609 16.8391L17.8359 15.4041L12.5859 12.2891V6.16406Z"
                    fill="white"
                  />
                </svg>
                <p className="text-[10px] md:text-[18px]">00:30:00</p>
              </div>
            </div>
          }
          className="p-3 mb-4 shadow bg-[#FFFFFF] text-[#393939]"
        >
          {[1, 2].map((item: any, index: number) => (
            <div
              key={index}
              className="border rounded-lg mb-2 p-3 bg-[#FFFFFF] text-[#393939]"
            >
              <div className="flex justify-between">
                <div className="flex justify-normal gap-2">
                  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M0.335938 12.0094C0.335938 5.5699 5.57242 0.335938 12.0026 0.335938C18.4328 0.335938 23.6693 5.5699 23.6693 12.0094C23.6693 18.4353 18.4328 23.6693 12.0026 23.6693C5.57242 23.6693 0.335938 18.4353 0.335938 12.0094ZM16.2819 13.1901C16.4058 13.0663 16.5634 12.8749 16.5972 12.8299C16.7774 12.5935 16.8675 12.3009 16.8675 12.0094C16.8675 11.6818 16.7661 11.3779 16.5747 11.1303C16.559 11.1146 16.5283 11.0812 16.4882 11.0376C16.4133 10.956 16.3058 10.839 16.2031 10.7363C15.2796 9.74581 12.8697 8.12497 11.6085 7.62971C11.417 7.55205 10.9328 7.38209 10.6738 7.37083C10.426 7.37083 10.1895 7.42711 9.96432 7.53967C9.68279 7.69725 9.45756 7.94488 9.33369 8.23753C9.25486 8.44013 9.13098 9.04795 9.13098 9.05921C9.00711 9.7233 8.93954 10.8039 8.93954 11.997C8.93954 13.1349 9.00711 14.1694 9.10846 14.8447C9.11125 14.8475 9.12094 14.8958 9.13599 14.9708C9.18174 15.199 9.27705 15.6742 9.37873 15.869C9.62648 16.3417 10.1107 16.6344 10.6287 16.6344H10.6738C11.0116 16.6231 11.7211 16.3305 11.7211 16.3192C12.9148 15.824 15.2684 14.2819 16.2143 13.2576L16.2819 13.1901Z"
                      fill="#B8B8B8"
                    />
                  </svg>

                  <p className="text-[10px] md:text-[18px]">
                    การทำงานกับโลกภายในของตนเอง
                  </p>
                </div>

                <p className="text-[10px] md:text-[18px]">00:15</p>
              </div>
            </div>
          ))}
        </AccordionItem>
      </Accordion>
    </div>
  );
}

export default Content;
